Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1294NCZAD.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER1</name>
      <prependToName>TIMER1</prependToName>
      <baseAddress>0x40031000</baseAddress>
      <interrupt><name>TIMER1A</name><value>21</value></interrupt>
      <interrupt><name>TIMER1B</name><value>22</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER2</name>
      <prependToName>TIMER2</prependToName>
      <baseAddress>0x40032000</baseAddress>
      <interrupt><name>TIMER2A</name><value>23</value></interrupt>
      <interrupt><name>TIMER2B</name><value>24</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER3</name>
      <prependToName>TIMER3</prependToName>
      <baseAddress>0x40033000</baseAddress>
      <interrupt><name>TIMER3A</name><value>35</value></interrupt>
      <interrupt><name>TIMER3B</name><value>36</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER4</name>
      <prependToName>TIMER4</prependToName>
      <baseAddress>0x40034000</baseAddress>
      <interrupt><name>TIMER4A</name><value>63</value></interrupt>
      <interrupt><name>TIMER4B</name><value>64</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER5</name>
      <prependToName>TIMER5</prependToName>
      <baseAddress>0x40035000</baseAddress>
      <interrupt><name>TIMER5A</name><value>65</value></interrupt>
      <interrupt><name>TIMER5B</name><value>66</value></interrupt>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <description>Register map for ADC0 peripheral</description>
      <groupName>ADC</groupName>
      <prependToName>ADC0</prependToName>
      <baseAddress>0x40038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>ADC0SS0</name><value>14</value></interrupt>
      <interrupt><name>ADC0SS1</name><value>15</value></interrupt>
      <interrupt><name>ADC0SS2</name><value>16</value></interrupt>
      <interrupt><name>ADC0SS3</name><value>17</value></interrupt>
      <registers>
        <register>
          <name>ACTSS</name>
          <description>ADC Active Sample Sequencer</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>ADC_ACTSS_ASEN0</name>
              <description>ADC SS0 Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN1</name>
              <description>ADC SS1 Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN2</name>
              <description>ADC SS2 Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN3</name>
              <description>ADC SS3 Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN0</name>
              <description>ADC SS1 DMA Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN1</name>
              <description>ADC SS1 DMA Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN2</name>
              <description>ADC SS2 DMA Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN3</name>
              <description>ADC SS3 DMA Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_BUSY</name>
              <description>ADC Busy</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>ADC Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>ADC_RIS_INR0</name>
              <description>SS0 Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INR1</name>
              <description>SS1 Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INR2</name>
              <description>SS2 Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INR3</name>
              <description>SS3 Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_DMAINR0</name>
              <description>SS0 DMA Raw Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_DMAINR1</name>
              <description>SS1 DMA Raw Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_DMAINR2</name>
              <description>SS2 DMA Raw Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_DMAINR3</name>
              <description>SS3 DMA Raw Interrupt Status</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INRDC</name>
              <description>Digital Comparator Raw Interrupt Status</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>ADC Interrupt Mask</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>ADC_IM_MASK0</name>
              <description>SS0 Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_IM_MASK1</name>
              <description>SS1 Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_IM_MASK2</name>
              <description>SS2 Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_IM_MASK3</name>
              <description>SS3 Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DMAMASK0</name>
              <description>SS0 DMA Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DMAMASK1</name>
              <description>SS1 DMA Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DMAMASK2</name>
              <description>SS2 DMA Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DMAMASK3</name>
              <description>SS3 DMA Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS0</name>
              <description>Digital Comparator Interrupt on SS0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS1</name>
              <description>Digital Comparator Interrupt on SS1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS2</name>
              <description>Digital Comparator Interrupt on SS2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS3</name>
              <description>Digital Comparator Interrupt on SS3</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <description>ADC Interrupt Status and Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>ADC_ISC_IN0</name>
              <description>SS0 Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_IN1</name>
              <description>SS1 Interrupt Status and Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_IN2</name>
              <description>SS2 Interrupt Status and Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_IN3</name>
              <description>SS3 Interrupt Status and Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DMAIN0</name>
              <description>SS0 DMA Interrupt Status and Clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DMAIN1</name>
              <description>SS1 DMA Interrupt Status and Clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DMAIN2</name>
              <description>SS2 DMA Interrupt Status and Clear</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DMAIN3</name>
              <description>SS3 DMA Interrupt Status and Clear</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS0</name>
              <description>Digital Comparator Interrupt Status on SS0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS1</name>
              <description>Digital Comparator Interrupt Status on SS1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS2</name>
              <description>Digital Comparator Interrupt Status on SS2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS3</name>
              <description>Digital Comparator Interrupt Status on SS3</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSTAT</name>
          <description>ADC Overflow Status</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>ADC_OSTAT_OV0</name>
              <description>SS0 FIFO Overflow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_OSTAT_OV1</name>
              <description>SS1 FIFO Overflow</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_OSTAT_OV2</name>
              <description>SS2 FIFO Overflow</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_OSTAT_OV3</name>
              <description>SS3 FIFO Overflow</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMUX</name>
          <description>ADC Event Multiplexer Select</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>ADC_EMUX_EM0</name>
              <description>SS0 Trigger Select</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM1</name>
              <description>SS1 Trigger Select</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM2</name>
              <description>SS2 Trigger Select</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM3</name>
              <description>SS3 Trigger Select</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
